# CustomFittingCreated Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CustomFittingCreated Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Custom fitting was created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CustomFittingCreated { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CustomFittingCreated As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CustomFittingCreated {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace